//////////////////////////////////////////////////////////////////////////////////////
// Module Name: vga_parameter_cfg.v
// Description: 定义各种规格屏幕的VGA各类参数
// Author/Data: Bahair_, 2025/8/8
// Revision: 2025/8/8 V1.0 released
// Copyright : Bahair_, Inc, All right reserved.
//////////////////////////////////////////////////////////////////////////////////////

`define vga_1024x768_60Hz
// `define vga_1920x1200_60Hz
// `define vga_640x480_60Hz
// `define vga_1920x1440_60Hz
// `define vga_1920x1080_60Hz
// `define vga_1024x600_60Hz
`ifdef vga_1024x768_60Hz // 62.5M 312.5M
    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义行参量
    `define H_TOTAL     1344
    `define H_DISP      1024
    `define H_BP        160
    `define H_FP        24
    `define H_SYNC      136
    
    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义场参量
    `define V_TOTAL     806
    `define V_DISP      768
    `define V_BP        29
    `define V_FP        3
    `define V_SYNC      6

    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义同步有效极性
    `define SYNC_POL    0
    
`elsif vga_1920x1200_60Hz
    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义行参量
    `define H_TOTAL     2592
    `define H_DISP      1920
    `define H_BP        0
    `define H_FP        136
    `define H_SYNC      200
    
    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义场参量
    `define V_TOTAL     1245
    `define V_DISP      1200
    `define V_BP        0
    `define V_FP        3
    `define V_SYNC      6

    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义同步有效极性
    `define SYNC_POL    0
    
`elsif vga_640x480_60Hz
    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义行参量
    `define H_TOTAL     800
    `define H_DISP      640
    `define H_BP        48
    `define H_FP        16
    `define H_SYNC      96
    
    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义场参量
    `define V_TOTAL     525
    `define V_DISP      480
    `define V_BP        33
    `define V_FP        10
    `define V_SYNC      2

    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义同步有效极性
    `define SYNC_POL    0
`elsif vga_1920x1440_60Hz
    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义行参量
    `define H_TOTAL     2600
    `define H_DISP      1920
    `define H_BP        0
    `define H_FP        128
    `define H_SYNC      208
    
    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义场参量
    `define V_TOTAL     1500
    `define V_DISP      1440
    `define V_BP        0
    `define V_FP        1
    `define V_SYNC      3

    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义同步有效极性
    `define SYNC_POL    0
`elsif vga_1920x1080_60Hz
    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义行参量
    `define H_TOTAL     (1920+88+148+44)
    `define H_DISP      1920
    `define H_BP        88
    `define H_FP        148
    `define H_SYNC      44
    
    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义场参量
    `define V_TOTAL     (1080+4+5+36)
    `define V_DISP      1080
    `define V_BP        4
    `define V_FP        36
    `define V_SYNC      5

    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义同步有效极性
    `define SYNC_POL    1

`elsif vga_1024x600_60Hz // pixclk_1x = 50M pixclk_5x = 250M
    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义行参量
    `define H_TOTAL     1344
    `define H_DISP      1024
    `define H_BP        140
    `define H_FP        160
    `define H_SYNC      20
    
    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义场参量
    `define V_TOTAL     635
    `define V_DISP      600
    `define V_BP        20
    `define V_FP        12
    `define V_SYNC      3

    //////////////////////////////////////////////////////////////////////////////////////
    // VGA 参数 - 定义同步有效极性
    `define SYNC_POL    0
`endif